Revit 2027 API
DockablePaneProviderData.FrameworkElementCreator Property
 A creator that will be called for the pane if the FrameworkElement is not set.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFrameworkElementCreator FrameworkElementCreator { get; set; }
Public Property FrameworkElementCreator As IFrameworkElementCreator
	Get
	Set
public:
property IFrameworkElementCreator^ FrameworkElementCreator {
	IFrameworkElementCreator^ get ();
	void set (IFrameworkElementCreator^ value);
}
member FrameworkElementCreator : IFrameworkElementCreator with get, set
Property Value
IFrameworkElementCreator
Remarks
 This is more dynamic in nature and allows for embedding things like WebBrowser controls that cannot be cached for reuse in each pane invocation but rather needs creating each time.
See Also
Reference
DockablePaneProviderData Class
Autodesk.Revit.UI Namespace